Mandy_Tang/week_05/day_03/nest/app/controllers/birds_controller.rb

  def index
    @birds = Bird.all
---
SELECT "birds".* FROM "birds"

  def create
    bird = Bird.create bird_params
---
INSERT INTO "birds" ("name", "species", "colour", "image") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Raven"], ["species", "Corvidae"], ["colour", "Black"], ["image", ""]]

  def destroy
    bird = Bird.find params[:id]
    bird.destroy
---
SELECT  "birds".* FROM "birds" WHERE "birds"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "birds" WHERE "birds"."id" = $1  [["id", 3]]

  def edit
    @bird = Bird.find params[:id]
---
SELECT  "birds".* FROM "birds" WHERE "birds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    bird = Bird.find params[:id]
    bird.update bird_params
---
SELECT  "birds".* FROM "birds" WHERE "birds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "birds" SET "image" = $1 WHERE "birds"."id" = $2  [["image", "http://d3lp4xedbqa8a5.cloudfront.net/s3/digital-cougar-assets/AusGeo/2016/12/02/64279/Superb-fairy-wren-nest-and-eggs.jpg"], ["id", 1]]

  def show
    @bird = Bird.find params[:id]
---
SELECT  "birds".* FROM "birds" WHERE "birds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]