Mandy_Tang/week_05/day_03/nest/app/controllers/eggs_controller.rb

  def index
    @eggs = Egg.all
---
SELECT "eggs".* FROM "eggs"

  def create
    egg = Egg.create egg_params
---
INSERT INTO "eggs" ("name", "pattern", "image") VALUES ($1, $2, $3) RETURNING "id"

  def destroy
    egg = Egg.find params[:id]
    egg.destroy
---
SELECT  "eggs".* FROM "eggs" WHERE "eggs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "eggs" WHERE "eggs"."id" = $1  [["id", 4]]

  def edit
    @egg = Egg.find params[:id]
---
SELECT  "eggs".* FROM "eggs" WHERE "eggs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    egg = Egg.find params[:id]
    egg.update egg_params
---
SELECT  "eggs".* FROM "eggs" WHERE "eggs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "eggs" SET "image" = $1 WHERE "eggs"."id" = $2  [["image", "http://www.africancuckoos.zoo.cam.ac.uk/fieldwork/images/Honeyguide-kingfisher.jpg"], ["id", 2]]

  def show
    @egg = Egg.find params[:id]
---
SELECT  "eggs".* FROM "eggs" WHERE "eggs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]