Mandy_Tang/week_05/day_03/nest/app/views/eggs/_form.html.erb

<%= f.label :bird_id %>
<%= f.select :bird_id, Bird.pluck(:name, :id), :include_blank => true %>
---
SELECT "birds"."name", "birds"."id" FROM "birds"