Mandy_Tang/week_05/day_03/nest/app/views/eggs/show.html.erb

SELECT  "birds".* FROM "birds" WHERE "birds"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---

<% if @egg.bird.present? %>