Mandy_Tang/week_05/day_03/nest/app/views/birds/show.html.erb

SELECT  1 AS one FROM "eggs" WHERE "eggs"."bird_id" = $1 LIMIT $2  [["bird_id", 2], ["LIMIT", 1]]
SELECT "eggs".* FROM "eggs" WHERE "eggs"."bird_id" = $1  [["bird_id", 1]]
---

<% unless @bird.eggs.empty? %>